#pragma once

#include <build_configuration/BuildConfigurationComponent.hpp>

#include <core/data_types/FundamentalTypes.hpp>
#include <core/utility/concepts/CallableConcepts.hpp>
#include <core/utility/template/TypeList.hpp>



namespace bc {
namespace utility {
namespace internal_ {

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<
	bool IsPlainFunctionCallable,
	bool IsMemberCallable,
	bool IsConstCallable,
	bool IsVolatileCallable,
	bool IsLValueOnlyCallable,
	bool IsRValueOnlyCallable,
	bool IsNoexceptCallable,
	typename CallableReturnType,
	typename ...CallableParameterTypePack
>
class CallableTraitsBase
{
public:
	using Signature				= CallableReturnType(CallableParameterTypePack...);
	using ReturnType			= CallableReturnType;
	using ParameterTypeList		= TypeList<CallableParameterTypePack...>;

	static consteval u64 ParameterCount() noexcept { return ParameterTypeList::Size(); }

	static consteval bool IsPlainFunction() { return IsPlainFunctionCallable; }
	static consteval bool IsMemberFunction() { return IsMemberCallable; }
	static consteval bool IsConst() { return IsConstCallable; }
	static consteval bool IsVolatile() { return IsVolatileCallable; }
	static consteval bool IsLValueOnly() { return IsLValueOnlyCallable; }
	static consteval bool IsRValueOnly() { return IsRValueOnlyCallable; }
	static consteval bool IsNoexcept() { return IsNoexceptCallable; }
};



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// @brief
/// Helper class to resolve the traits of a callable object.
///
/// Specializations below are used to resolve the traits of each callable object operator().
///
/// @tparam Type
/// Unused.
template<typename Type>
class CallableObjectResolver
{
	// Disabled default error condition because it may be useful to use this class as a test in SFINAE, eg. in deduction guides.
	//static constexpr bool is_callable = []<bool b = false>(){
	//	static_assert( b, "Cannot get a callable traits from a non callable type." );
	//	return b;
	//}();
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... )>
	: public CallableTraitsBase<false, false, false, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const>
	: public CallableTraitsBase<false, false, true, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile>
	: public CallableTraitsBase<false, false, false, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile>
	: public CallableTraitsBase<false, false, true, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) &>
	: public CallableTraitsBase<false, false, false, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const &>
	: public CallableTraitsBase<false, false, true, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile &>
	: public CallableTraitsBase<false, false, false, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile &>
	: public CallableTraitsBase<false, false, true, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) &&>
	: public CallableTraitsBase<false, false, false, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const &&>
	: public CallableTraitsBase<false, false, true, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile &&>
	: public CallableTraitsBase<false, false, false, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile &&>
	: public CallableTraitsBase<false, false, true, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) noexcept>
	: public CallableTraitsBase<false, false, false, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const noexcept>
	: public CallableTraitsBase<false, false, true, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile noexcept>
	: public CallableTraitsBase<false, false, false, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile noexcept>
	: public CallableTraitsBase<false, false, true, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) & noexcept>
	: public CallableTraitsBase<false, false, false, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const & noexcept>
	: public CallableTraitsBase<false, false, true, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile & noexcept>
	: public CallableTraitsBase<false, false, false, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile & noexcept>
	: public CallableTraitsBase<false, false, true, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) && noexcept>
	: public CallableTraitsBase<false, false, false, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const && noexcept>
	: public CallableTraitsBase<false, false, true, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) volatile && noexcept>
	: public CallableTraitsBase<false, false, false, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableObjectResolver<CallableReturnType( CallableClassType::* )( CallableParameterTypePack... ) const volatile && noexcept>
	: public CallableTraitsBase<false, false, true, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

} // internal_



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// @brief
/// Collects information about a callable object.
///
/// This class is useful when trying to extract information from a callable object.
///
/// @tparam CallableType
/// Callable object type.
template<typename CallableType>
class CallableTraits
{
	// Disabled default error condition because it may be useful to use this class as a test in SFINAE, eg. in deduction guides.
	//static constexpr bool is_callable = []<bool b = false>(){
	//	static_assert( b, "Not a callable type" );
	//	return b;
	//}();
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<CallableObject CallableType>
class CallableTraits<CallableType> :
	public internal_::CallableObjectResolver<decltype( &CallableType::operator() )>
{};



// Plain functions.

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...)> :
	public internal_::CallableTraitsBase<true, false, false, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const> :
	public internal_::CallableTraitsBase<true, false, true, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile> :
	public internal_::CallableTraitsBase<true, false, false, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile> :
	public internal_::CallableTraitsBase<true, false, true, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) &> :
	public internal_::CallableTraitsBase<true, false, false, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const &> :
	public internal_::CallableTraitsBase<true, false, true, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile &> :
	public internal_::CallableTraitsBase<true, false, false, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile &> :
	public internal_::CallableTraitsBase<true, false, true, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) &&> :
	public internal_::CallableTraitsBase<true, false, false, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const &&> :
	public internal_::CallableTraitsBase<true, false, true, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile &&> :
	public internal_::CallableTraitsBase<true, false, false, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile &&> :
	public internal_::CallableTraitsBase<true, false, true, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) noexcept> :
	public internal_::CallableTraitsBase<true, false, false, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const noexcept> :
	public internal_::CallableTraitsBase<true, false, true, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile noexcept> :
	public internal_::CallableTraitsBase<true, false, false, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile noexcept> :
	public internal_::CallableTraitsBase<true, false, true, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) & noexcept> :
	public internal_::CallableTraitsBase<true, false, false, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const & noexcept> :
	public internal_::CallableTraitsBase<true, false, true, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile & noexcept> :
	public internal_::CallableTraitsBase<true, false, false, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile & noexcept> :
	public internal_::CallableTraitsBase<true, false, true, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) && noexcept> :
	public internal_::CallableTraitsBase<true, false, false, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const && noexcept> :
	public internal_::CallableTraitsBase<true, false, true, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) volatile && noexcept> :
	public internal_::CallableTraitsBase<true, false, false, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType(CallableParameterTypePack...) const volatile && noexcept> :
	public internal_::CallableTraitsBase<true, false, true, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};



// Member functions.

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... )> :
	public internal_::CallableTraitsBase<true, true, false, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const> :
	public internal_::CallableTraitsBase<true, true, true, false, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile> :
	public internal_::CallableTraitsBase<true, true, false, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile> :
	public internal_::CallableTraitsBase<true, true, true, true, false, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) &> :
	public internal_::CallableTraitsBase<true, true, false, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const &> :
	public internal_::CallableTraitsBase<true, true, true, false, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile &> :
	public internal_::CallableTraitsBase<true, true, false, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile&> :
	public internal_::CallableTraitsBase<true, true, true, true, true, false, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) &&> :
	public internal_::CallableTraitsBase<true, true, false, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const &&> :
	public internal_::CallableTraitsBase<true, true, true, false, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile &&> :
	public internal_::CallableTraitsBase<true, true, false, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile &&> :
	public internal_::CallableTraitsBase<true, true, true, true, false, true, false, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) noexcept> :
	public internal_::CallableTraitsBase<true, true, false, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const noexcept> :
	public internal_::CallableTraitsBase<true, true, true, false, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile noexcept> :
	public internal_::CallableTraitsBase<true, true, false, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile noexcept> :
	public internal_::CallableTraitsBase<true, true, true, true, false, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) & noexcept> :
	public internal_::CallableTraitsBase<true, true, false, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const & noexcept> :
	public internal_::CallableTraitsBase<true, true, true, false, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile & noexcept> :
	public internal_::CallableTraitsBase<true, true, false, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile & noexcept> :
	public internal_::CallableTraitsBase<true, true, true, true, true, false, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) && noexcept> :
	public internal_::CallableTraitsBase<true, true, false, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const && noexcept> :
	public internal_::CallableTraitsBase<true, true, true, false, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) volatile && noexcept> :
	public internal_::CallableTraitsBase<true, true, false, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename CallableReturnType, typename ...CallableParameterTypePack>
class CallableTraits<CallableReturnType( ClassType::* )( CallableParameterTypePack... ) const volatile && noexcept> :
	public internal_::CallableTraitsBase<true, true, true, true, false, true, true, CallableReturnType, CallableParameterTypePack...>
{};



#ifdef BITCRAFTE_ENGINE_DEVELOPMENT_BUILD
namespace tests {

// Basic functions.
static_assert( sizeof( CallableTraits<void()> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double )> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) &> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const &> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile &> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile &> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) &&> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const &&> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile &&> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile &&> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) & noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const & noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile & noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile & noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) && noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const && noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) volatile && noexcept> ) == 1 );
static_assert( sizeof( CallableTraits<void( int, float, double ) const volatile && noexcept> ) == 1 );

static_assert( std::is_same_v<CallableTraits<void()>::ReturnType, void> );
static_assert( std::is_same_v<CallableTraits<void( int, float, double )>::ReturnType, void> );
static_assert( std::is_same_v<CallableTraits<int()>::ReturnType, int> );
static_assert( std::is_same_v<CallableTraits<int( int, float, double )>::ReturnType, int> );

static_assert( std::is_same_v<CallableTraits<void()>::ParameterTypeList, TypeList<>> );
static_assert( std::is_same_v<CallableTraits<void( int, float, double )>::ParameterTypeList, TypeList<int, float, double>> );
static_assert( std::is_same_v<CallableTraits<void( int, float, double ) const>::ParameterTypeList, TypeList<int, float, double>> );
static_assert( std::is_same_v<CallableTraits<void( int, float, double ) volatile>::ParameterTypeList, TypeList<int, float, double>> );
