#pragma once

#include <build_configuration/BuildConfigurationComponent.hpp>

#include <core/data_types/FundamentalTypes.hpp>
#include <core/utility/concepts/TypeTraitConcepts.hpp>
#include <core/utility/template/TypeList.hpp>



namespace bc {
namespace utility {
namespace internal_ {

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<
	bool IsPlainFunctionInvocable,
	bool IsMemberInvocable,
	bool IsConstInvocable,
	bool IsVolatileInvocable,
	bool IsLValueOnlyInvocable,
	bool IsRValueOnlyInvocable,
	bool IsNoexceptInvocable,
	typename InvocableReturnType,
	typename ...InvocableParameterTypePack
>
class InvocableTraitsBase
{
public:
	using Signature				= InvocableReturnType(InvocableParameterTypePack...);
	using ReturnType			= InvocableReturnType;
	using ParameterTypeList		= TypeList<InvocableParameterTypePack...>;

	static consteval auto ParameterCount() noexcept { return ParameterTypeList::Size(); }

	static consteval auto IsPlainFunction() { return IsPlainFunctionInvocable; }
	static consteval auto IsMemberFunction() { return IsMemberInvocable; }
	static consteval auto IsConst() { return IsConstInvocable; }
	static consteval auto IsVolatile() { return IsVolatileInvocable; }
	static consteval auto IsLValueOnly() { return IsLValueOnlyInvocable; }
	static consteval auto IsRValueOnly() { return IsRValueOnlyInvocable; }
	static consteval auto IsNoexcept() { return IsNoexceptInvocable; }
};



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// @brief
/// Helper class to resolve the traits of a Invocable object.
///
/// Specializations below are used to resolve the traits of each Invocable object operator().
///
/// @tparam Type
/// Unused.
template<typename Type>
class InvocableObjectResolver
{
	// Disabled default error condition because it may be useful to use this class as a test in SFINAE, eg. in deduction guides.
	//static constexpr bool is_Invocable = []<bool b = false>(){
	//	static_assert( b, "Cannot get a Invocable traits from a non Invocable type." );
	//	return b;
	//}();
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... )>
	: public InvocableTraitsBase<false, false, false, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const>
	: public InvocableTraitsBase<false, false, true, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile>
	: public InvocableTraitsBase<false, false, false, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile>
	: public InvocableTraitsBase<false, false, true, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) &>
	: public InvocableTraitsBase<false, false, false, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const &>
	: public InvocableTraitsBase<false, false, true, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile &>
	: public InvocableTraitsBase<false, false, false, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile &>
	: public InvocableTraitsBase<false, false, true, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) &&>
	: public InvocableTraitsBase<false, false, false, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const &&>
	: public InvocableTraitsBase<false, false, true, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile &&>
	: public InvocableTraitsBase<false, false, false, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile &&>
	: public InvocableTraitsBase<false, false, true, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) noexcept>
	: public InvocableTraitsBase<false, false, false, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const noexcept>
	: public InvocableTraitsBase<false, false, true, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile noexcept>
	: public InvocableTraitsBase<false, false, false, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile noexcept>
	: public InvocableTraitsBase<false, false, true, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) & noexcept>
	: public InvocableTraitsBase<false, false, false, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const & noexcept>
	: public InvocableTraitsBase<false, false, true, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile & noexcept>
	: public InvocableTraitsBase<false, false, false, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile & noexcept>
	: public InvocableTraitsBase<false, false, true, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) && noexcept>
	: public InvocableTraitsBase<false, false, false, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const && noexcept>
	: public InvocableTraitsBase<false, false, true, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) volatile && noexcept>
	: public InvocableTraitsBase<false, false, false, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableObjectResolver<InvocableReturnType( InvocableClassType::* )( InvocableParameterTypePack... ) const volatile && noexcept>
	: public InvocableTraitsBase<false, false, true, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

} // internal_



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// @brief
/// Collects information about a Invocable object.
///
/// This class is useful when trying to extract information from a Invocable object.
///
/// @tparam InvocableType
/// Invocable object type.
template<typename InvocableType>
class InvocableTraits
{
	// Disabled default error condition because it may be useful to use this class as a test in SFINAE, eg. in deduction guides.
	//static constexpr bool is_Invocable = []<bool b = false>(){
	//	static_assert( b, "Not a Invocable type" );
	//	return b;
	//}();
};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<InvocableObject InvocableType>
class InvocableTraits<InvocableType> :
	public internal_::InvocableObjectResolver<decltype( &InvocableType::operator() )>
{};



// Plain functions.

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...)> :
	public internal_::InvocableTraitsBase<true, false, false, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const> :
	public internal_::InvocableTraitsBase<true, false, true, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile> :
	public internal_::InvocableTraitsBase<true, false, false, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile> :
	public internal_::InvocableTraitsBase<true, false, true, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) &> :
	public internal_::InvocableTraitsBase<true, false, false, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const &> :
	public internal_::InvocableTraitsBase<true, false, true, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile &> :
	public internal_::InvocableTraitsBase<true, false, false, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile &> :
	public internal_::InvocableTraitsBase<true, false, true, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) &&> :
	public internal_::InvocableTraitsBase<true, false, false, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const &&> :
	public internal_::InvocableTraitsBase<true, false, true, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile &&> :
	public internal_::InvocableTraitsBase<true, false, false, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile &&> :
	public internal_::InvocableTraitsBase<true, false, true, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) & noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const & noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile & noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile & noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) && noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const && noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) volatile && noexcept> :
	public internal_::InvocableTraitsBase<true, false, false, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType(InvocableParameterTypePack...) const volatile && noexcept> :
	public internal_::InvocableTraitsBase<true, false, true, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};



// Member functions.

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... )> :
	public internal_::InvocableTraitsBase<true, true, false, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const> :
	public internal_::InvocableTraitsBase<true, true, true, false, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile> :
	public internal_::InvocableTraitsBase<true, true, false, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile> :
	public internal_::InvocableTraitsBase<true, true, true, true, false, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) &> :
	public internal_::InvocableTraitsBase<true, true, false, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const &> :
	public internal_::InvocableTraitsBase<true, true, true, false, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile &> :
	public internal_::InvocableTraitsBase<true, true, false, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile&> :
	public internal_::InvocableTraitsBase<true, true, true, true, true, false, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) &&> :
	public internal_::InvocableTraitsBase<true, true, false, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const &&> :
	public internal_::InvocableTraitsBase<true, true, true, false, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile &&> :
	public internal_::InvocableTraitsBase<true, true, false, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile &&> :
	public internal_::InvocableTraitsBase<true, true, true, true, false, true, false, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, false, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, true, false, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) & noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const & noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, false, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile & noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile & noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, true, true, false, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) && noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const && noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, false, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) volatile && noexcept> :
	public internal_::InvocableTraitsBase<true, true, false, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
template<typename ClassType, typename InvocableReturnType, typename ...InvocableParameterTypePack>
class InvocableTraits<InvocableReturnType( ClassType::* )( InvocableParameterTypePack... ) const volatile && noexcept> :
	public internal_::InvocableTraitsBase<true, true, true, true, false, true, true, InvocableReturnType, InvocableParameterTypePack...>
{};



#ifdef BITCRAFTE_ENGINE_DEVELOPMENT_BUILD
namespace tests {

// Basic functions.
static_assert( sizeof( InvocableTraits<void()> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double )> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) &> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const &> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile &> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile &> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) &&> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const &&> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile &&> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile &&> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) & noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const & noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile & noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile & noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) && noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const && noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) volatile && noexcept> ) == 1 );
static_assert( sizeof( InvocableTraits<void( int, float, double ) const volatile && noexcept> ) == 1 );

static_assert( std::is_same_v<InvocableTraits<void()>::ReturnType, void> );
static_assert( std::is_same_v<InvocableTraits<void( int, float, double )>::ReturnType, void> );
static_assert( std::is_same_v<InvocableTraits<int()>::ReturnType, int> );
static_assert( std::is_same_v<InvocableTraits<int( int, float, double )>::ReturnType, int> );

static_assert( std::is_same_v<InvocableTraits<void()>::ParameterTypeList, TypeList<>> );
static_assert( std::is_same_v<InvocableTraits<void( int, float, double )>::ParameterTypeList, TypeList<int, float, double>> );
static_assert( std::is_same_v<InvocableTraits<void( int, float, double ) const>::ParameterTypeList, TypeList<int, float, double>> );
static_assert( std::is_same_v<InvocableTraits<void( int, float, double ) volatile>::ParameterTypeList, TypeList<int, float, double>> );
